{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_1","layers":[{"class_name":"Bidirectional","config":{"merge_mode":"concat","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM1","trainable":true,"units":32,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional1","trainable":true,"batch_input_shape":[null,10,1],"dtype":"float32"}},{"class_name":"Bidirectional","config":{"merge_mode":"concat","layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM2","trainable":true,"units":32,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional2","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true}}]},"keras_version":"tfjs-layers 4.17.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"bidirectional_Bidirectional1/forward_lstm_LSTM1/kernel","shape":[1,128],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/forward_lstm_LSTM1/recurrent_kernel","shape":[32,128],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/forward_lstm_LSTM1/bias","shape":[128],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/backward_lstm_LSTM1/kernel","shape":[1,128],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/backward_lstm_LSTM1/recurrent_kernel","shape":[32,128],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/backward_lstm_LSTM1/bias","shape":[128],"dtype":"float32"},{"name":"bidirectional_Bidirectional2/forward_lstm_LSTM2/kernel","shape":[64,128],"dtype":"float32"},{"name":"bidirectional_Bidirectional2/forward_lstm_LSTM2/recurrent_kernel","shape":[32,128],"dtype":"float32"},{"name":"bidirectional_Bidirectional2/forward_lstm_LSTM2/bias","shape":[128],"dtype":"float32"},{"name":"bidirectional_Bidirectional2/backward_lstm_LSTM2/kernel","shape":[64,128],"dtype":"float32"},{"name":"bidirectional_Bidirectional2/backward_lstm_LSTM2/recurrent_kernel","shape":[32,128],"dtype":"float32"},{"name":"bidirectional_Bidirectional2/backward_lstm_LSTM2/bias","shape":[128],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[64,1],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.17.0","convertedBy":null}